system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices 
(
    (-0.7071 -0.7071 0) //0
    (0.7071 -0.7071 0) //1
    (0.7071 0.7071 0)  //2
    (-0.7071 0.7071 0)  //3

    (-2 -2 0) //4
    (2 -2 0) //5
    (2 2 0) //6
    (-2 2 0) //7

    (-11 -17 0) //8
    (-2 -17 0)  //9
    (2 -17 0)   //10
    (11 -17 0)  //11
    (41 -17 0)  //12

    (-11 -2 0)  //13
    (11 -2 0)   //14
    (41 -2 0)   //15
    
    (-11 2 0)   //16
    (11 2 0)    //17
    (41 2 0)    //18
    
    (-11 17 0)  //19
    (-2 17 0)   //20
    (2 17 0)    //21
    (11 17 0)   //22
    (41 17 0)   //23

    (-0.7071 -0.7071 0.01) //24
    (0.7071 -0.7071 0.01) //25
    (0.7071 0.7071 0.01) //26
    (-0.7071 0.7071 0.01) //27

    (-2 -2 0.01)   //28
    (2 -2 0.01)    //29
    (2 2 0.01)     //30
    (-2 2 0.01)    //31
    
    (-11 -17 0.01) //32
    (-2 -17 0.01)  //33
    (2 -17 0.01)   //34
    (11 -17 0.01)  //35
    (41 -17 0.01)  //36

    (-11 -2 0.01)  //37
    (11 -2 0.01)   //38
    (41 -2 0.01)   //39
    
    (-11 2 0.01)   //40
    (11 2 0.01)    //41
    (41 2 0.01)    //42
    
    (-11 17 0.01)  //43
    (-2 17 0.01)   //44
    (2 17 0.01)    //45
    (11 17 0.01)   //46
    (41 17 0.01)   //47
);

blocks
(
    hex (0 4 5 1 24 28 29 25) (40 40 1) simpleGrading (1 1 1)
    hex (1 5 6 2 25 29 30 26) (40 40 1) simpleGrading (1 1 1)
    hex (2 6 7 3 26 30 31 27) (40 40 1) simpleGrading (1 1 1)   
    hex (0 3 7 4 24 27 31 28) (40 40 1) simpleGrading (1 1 1)   

    hex (13 4 7 16 37 28 31 40) (40 40 1) simpleGrading (1 1 1)
    hex (5 14 17 6 29 38 41 30) (40 40 1) simpleGrading (1 1 1)
    hex (14 15 18 17 38 39 42 41) (40 40 1) simpleGrading (1 1 1)

    hex (8 9 4 13 32 33 28 37) (40 40 1) simpleGrading (1 1 1)
    hex (9 10 5 4 33 34 29 28) (40 40 1) simpleGrading (1 1 1)
    hex (10 11 14 5 34 35 38 29) (40 40 1) simpleGrading (1 1 1)
    hex (11 12 15 14 35 36 39 38) (40 40 1) simpleGrading (1 1 1)

    hex (16 7 20 19 40 31 44 43) (40 40 1) simpleGrading (1 1 1)
    hex (7 6 21 20 31 30 45 44) (40 40 1) simpleGrading (1 1 1)
    hex (6 17 22 21 30 41 46 45) (40 40 1) simpleGrading (1 1 1)
    hex (17 18 23 22 41 42 47 46) (40 40 1) simpleGrading (1 1 1)
);


edges
(
    arc 0 1 (0 -1 0)
    arc 24 25 (0 -1 0.01)

    arc 1 2 (1 0 0)
    arc 25 26 (1 0 0.01)

    arc 2 3 (0 1 0)
    arc 26 27 (0 1 0.01)

    arc 3 0 (-1 0 0)
    arc 27 24 (-1 0 0.01)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 13 37 32)
            (13 16 40 37)
            (16 19 43 40)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (12 15 39 36)
            (15 18 42 39)
            (18 23 47 42)
        );
    }

    topAndbottom
    {
        type patch;
        faces
    (
        (19 20 44 43)
        (20 21 45 44)
        (21 22 46 45)
        (22 23 47 46)

        (8 9 33 32)
        (9 10 34 33)
        (10 11 35 34)
        (11 12 36 35)
    );
    }

    cylinder
    {
        type patch;
        faces
        (
            (0 1 25 24)
            (1 2 26 25)
            (2 3 27 26)
            (3 0 24 27)
        );
    }
);
// ************************************************************************* //
